In [2]:
from openpyxl import Workbook
wb = Workbook()
wb.sheetnames

['Sheet']

In [2]:
ws =wb.active

In [3]:
ws2 = wb.create_sheet("추가1")
wb.create_sheet("또 추가2")
wb.sheetnames

['Sheet', '추가1', '또 추가2']

In [4]:
ws = wb['Sheet']  #워크시트 선택
ws.title = '주소'
ws.title

'주소'

In [5]:
ws['A1']='이름'
ws['B1']='전화번호'
ws['A2']= '홍길동'
ws['B2']='0101112222'

ws.cell(row=3,column=1).value='김길동'
ws.cell(row=3,column=2).value='0103334444'

wb.save('./excel/address.xlsx')

In [10]:
from openpyxl import load_workbook
wb = load_workbook("./excel/address.xlsx")
wb.sheetnames

['주소', '추가1', '또 추가2']

In [17]:
for row in ws.iter_rows():
    for cell in row:
        print(cell, cell.value)

<Cell '주소'.A1> 이름
<Cell '주소'.B1> 전화번호
<Cell '주소'.A2> 홍길동
<Cell '주소'.B2> 0101112222
<Cell '주소'.A3> 김길동
<Cell '주소'.B3> 0103334444

In [1]:
import pandas as pd

In [37]:
df =pd.read_excel('./excel/address.xlsx','추가1')
df

   번호   이름  성적
0   1  박길동  50
1   2  최길동  55
2   3  AAA  60
3   4  BBB  65
4   5  CCC  70
5   6  DDD  75
6   7  EEE  80
7   8  FFF  85
8   9  GGG  90
9  10  HHH  95

In [53]:
df.loc[:,'번호':'이름']

   번호   이름
0   1  박길동
1   2  최길동
2   3  AAA
3   4  BBB
4   5  CCC
5   6  DDD
6   7  EEE
7   8  FFF
8   9  GGG
9  10  HHH

In [56]:
df.iloc[:]

   번호   이름  성적
1   2  최길동  55
2   3  AAA  60
3   4  BBB  65

In [69]:
for index,row in df.iterrows():
    print(row[1])

박길동
최길동
AAA
BBB
CCC
DDD
EEE
FFF
GGG
HHH

In [70]:
df.values

array([[1, '박길동', 50],
       [2, '최길동', 55],
       [3, 'AAA', 60],
       [4, 'BBB', 65],
       [5, 'CCC', 70],
       [6, 'DDD', 75],
       [7, 'EEE', 80],
       [8, 'FFF', 85],
       [9, 'GGG', 90],
       [10, 'HHH', 95]], dtype=object)

In [77]:
for column in df:
    print(column, list(df[column]))

번호 [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
이름 ['박길동', '최길동', 'AAA', 'BBB', 'CCC', 'DDD', 'EEE', 'FFF', 'GGG', 'HHH']
성적 [50, 55, 60, 65, 70, 75, 80, 85, 90, 95]